In [1]:
import numpy as np
import pandas as  pd

In [3]:
data = {
    "Name": ["Alice", "Bob", "Charlie", "David", "Eve", "Alice"],
    "Age": [25, 30, 35, np.nan, 29, 25],
    "Department": ["HR", "IT", "Finance", "IT", "HR", "HR"],
    "Salary": [50000, 60000, 70000, 62000, np.nan, 50000]
}
df = pd.DataFrame(data)
df

      Name   Age Department   Salary
0    Alice  25.0         HR  50000.0
1      Bob  30.0         IT  60000.0
2  Charlie  35.0    Finance  70000.0
3    David   NaN         IT  62000.0
4      Eve  29.0         HR      NaN
5    Alice  25.0         HR  50000.0

In [7]:
# duplicate
df_dup = df[df.duplicated(keep= "first")]
df_dup

    Name   Age Department   Salary
5  Alice  25.0         HR  50000.0

In [9]:
# keep method used for start checking the data from fast or last
df_dup = df[df.duplicated(keep= "last")]
df_dup

    Name   Age Department   Salary
0  Alice  25.0         HR  50000.0

In [ ]:
# delete the duplicate
df = df.drop_duplicates()
df